{"ruleId": "ru_872b18b7-64a4-4466-b694-e41d19e451ba", "versionId": "ru_872b18b7-64a4-4466-b694-e41d19e451ba@v_1715163202_310431000", "ruleName": "AWS_Redshift_Snapshot_Shared", "metadata": {"mitre_ttp": "", "mitre_mitigation": "", "name": "AWS_Redshift_Snapshot_Shared", "author": "Deloitte", "description": "This rule detects a user who try to share redshift snapshot that being share", "severity": "Medium"}, "ruleText": "rule AWS_Redshift_Snapshot_Shared\n//You can share an existing manual snapshot with other AWS customer accounts by authorizing access to the snapshot\n//You can authorize up to 20 for each snapshot and 100 for each AWS Key Management Service (AWS KMS) key\n{\n\n  meta:\n    name = \"AWS_Redshift_Snapshot_Shared\"\n    author = \"Deloitte\"\n    description = \"This rule detects a user who try to share redshift snapshot that being share\"\n    severity = \"Medium\"\n    mitre_ttp = \"\"\n    mitre_mitigation = \"\"\n\n  events:\n    $e.metadata.vendor_name = \"AMAZON\"\n    $e.metadata.product_name = \"AWS CloudTrail\" or $e.metadata.product_name = \"Redshift\"\n    $e.metadata.product_event_type = \"AuthorizeSnapshotAccess\"\n    $e.metadata.product_event_type = \"RevokeSnapshotAccess\"\n    $e.security_result.action = \"ALLOW\"\n\n\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-05-08T10:13:22.310431Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-05-08T10:11:44.851695Z"}