{"ruleId": "ru_21dc4138-b14f-4d66-a3f1-361e006155a5", "versionId": "ru_21dc4138-b14f-4d66-a3f1-361e006155a5@v_1715255910_354543000", "ruleName": "AWS_Route_53_DNS_query_logging_disabled", "metadata": {"data_source": "AWS CloudTrail", "platform": "AWS", "severity": "High", "name": "AWS_Route_53_DNS_query_logging_disabled", "author": "Deloitte", "description": "Detect when a user deletes a Route 53 query logging configuration.", "mitre_attack_tactic": "Defense Evasion", "mitre_attack_technique": "Impair Defenses: Disable Cloud Logs"}, "ruleText": " rule AWS_Route_53_DNS_query_logging_disabled {\n  \n  meta:\n    name=\"AWS_Route_53_DNS_query_logging_disabled\"\n    author = \"Deloitte\"\n    description = \"Detect when a user deletes a Route 53 query logging configuration.\"\n    mitre_attack_tactic = \"Defense Evasion\"\n    mitre_attack_technique = \"Impair Defenses: Disable Cloud Logs\"\n    data_source = \"AWS CloudTrail\"\n    platform = \"AWS\"\n    severity = \"High\"\n\n  events:\n    $cloudtrail.metadata.vendor_name = \"AMAZON\"\n    $cloudtrail.metadata.product_name = \"AWS CloudTrail\"\n    $cloudtrail.metadata.product_event_type = \"DeleteQueryLoggingConfig \"\n    $cloudtrail.security_result.action = \"ALLOW\"\n    $cloudtrail.principal.user.user_display_name = $user_id\n\n  match:\n    $user_id over 1h\n\n  outcome:\n    $risk_score = max(75)\n    $mitre_attack_tactic = \"Defense Evasion\"\n    $mitre_attack_technique = \"Impair Defenses: Disable Cloud Logs\"\n    $mitre_attack_technique_id = \"T1562.008\"\n    $event_count = count_distinct($cloudtrail.metadata.id)\n    $network_http_user_agent = array_distinct($cloudtrail.network.http.user_agent)\n    $principal_ip = array_distinct($cloudtrail.principal.ip)\n    $principal_ip_country = array_distinct($cloudtrail.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($cloudtrail.principal.ip_geo_artifact.location.state)\n    $principal_user_display_name = array_distinct($cloudtrail.principal.user.user_display_name)\n    $recipient_aws_account_id = array_distinct($cloudtrail.target.resource.attribute.labels[\"Recipient Account Id\"])\n    $aws_region = array_distinct($cloudtrail.principal.location.name)\n    $target_resource_name = array_distinct($cloudtrail.target.resource.name)\n    $target_resource_product_object_id = array_distinct($cloudtrail.target.resource.product_object_id)\n\n  condition:\n    $cloudtrail\n}\n", "versionCreateTime": "2024-05-09T11:58:30.354543Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-04-18T14:57:37.923359Z"}