{"ruleId": "ru_cc27aacb-68a3-4a95-817e-5a87c21cd8fc", "versionId": "ru_cc27aacb-68a3-4a95-817e-5a87c21cd8fc@v_1715162411_567455000", "ruleName": "AWS_EC2_Disable_Image_Block_Public_Access", "metadata": {"author": "Deloitte", "description": "This rule detects disabling of a block public access to an image(AMI). when block public access is enabled any attempt to make an AMI public is automatically blocked", "severity": "High", "mitre_ttp": "", "mitre_mitigation": "", "name": "AWS_EC2_Disable_Image_Block_Public_Access"}, "ruleText": "rule AWS_EC2_Disable_Image_Block_Public_Access \n//by blocking publick access for AMIs you prevent unauthorized access and potential risk of AMI data\n{\n  meta:\n    name = \"AWS_EC2_Disable_Image_Block_Public_Access\"\n    author = \"Deloitte\"\n    description = \"This rule detects disabling of a block public access to an image(AMI). when block public access is enabled any attempt to make an AMI public is automatically blocked\"\n    severity = \"High\"\n    mitre_ttp = \"\"\n    mitre_mitigation = \"\"\n\n  events:\n    $e.metadata.vendor_name = \"AMAZON\"\n    $e.metadata.product_name = \"AWS CloudTrail\"\n    $e.metadata.product_event_type = \"DisableImageBlockPublicAccess\"\n    $e.security_result.action = \"ALLOW\"\n    $e.principal.user.userid = $user_id\n\n  match:\n    $user_id over 1m\n\n\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-05-08T10:00:11.567455Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-05-08T09:57:22.818399Z"}