{"ruleId": "ru_9e3a8c9e-8d8f-408a-a086-d2e0ce6aab91", "versionId": "ru_9e3a8c9e-8d8f-408a-a086-d2e0ce6aab91@v_1719412176_274383000", "ruleName": "GCP_Service_Account_Modified", "metadata": {"description": "This rule identifies when a service account is modified in Google Cloud.", "severity": "Medium", "mitre_attack_tactic": "Impact", "mitre_attack_technique": "Account Access Removal", "name": "GCP_Service_Account_Modified", "author": "Deloitte"}, "ruleText": " rule GCP_Service_Account_Modified \n {\n\n  meta:\n    name= \"GCP_Service_Account_Modified\"\n    author = \"Deloitte\"\n    description = \"This rule identifies when a service account is modified in Google Cloud.\"\n    severity = \"Medium\"\n    mitre_attack_tactic = \"Impact\"\n    mitre_attack_technique = \"Account Access Removal\"\n\n\n  events:\n    // //Adding to a Service Account OWNER / EDITOR / VIEWER role\n    $e.metadata.event_type = \"USER_RESOURCE_UPDATE_PERMISSIONS\"\n    $e.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $e.metadata.product_event_type = \"google.iam.admin.v1.SetIAMPolicy\"\n    $e.metadata.product_name = \"Google Cloud IAM\"\n    $e.principal.user.attribute.permissions.name = \"iam.serviceAccounts.setIamPolicy\"\n    $e.security_result.action = \"ALLOW\"\n    $e.target.application = \"iam.googleapis.com\"\n    $e.target.resource.attribute.labels[\"ser_binding_deltas_action\"] = \"ADD\"\n\n    (\n    $e.target.resource.attribute.labels[\"ser_binding_deltas_role\"] = \"roles/owner\" or\n    $e.target.resource.attribute.labels[\"ser_binding_deltas_role\"] = \"roles/editor\" or \n    $e.target.resource.attribute.labels[\"ser_binding_deltas_role\"] = \"roles/viewer\"\n    )\n\n    $e.target.resource.resource_subtype = \"service_account\"\n    $e.target.resource.resource_type = \"SERVICE_ACCOUNT\"\n  \n\n\n\n  condition:\n    $e\n}\n", "liveRuleEnabled": true, "versionCreateTime": "2024-06-26T14:29:36.274383Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-19T11:47:44.787199Z"}