{"ruleId": "ru_1a8de2d0-6a1b-4ea2-a505-ff0615f43e32", "versionId": "ru_1a8de2d0-6a1b-4ea2-a505-ff0615f43e32@v_1718795259_805609000", "ruleName": "GCP_multiple_kms_keys_disabled_or_destroyed", "metadata": {"severity": "High", "author": "Deloitte", "description": "This rule detect when multiple KMS crypto key versions are disabled or destroyed from GCP Cloud KMS", "mitre_attack_tactic": "Impact", "mitre_attack_technique": "Data Destruction", "data_source": "GCP Cloud Audit", "platform": "GCP"}, "ruleText": "rule GCP_multiple_kms_keys_disabled_or_destroyed \n{\n\n  meta:\n    author = \"Deloitte\"\n    description = \"This rule detect when multiple KMS crypto key versions are disabled or destroyed from GCP Cloud KMS\"\n    mitre_attack_tactic = \"Impact\"\n    mitre_attack_technique = \"Data Destruction\"\n    data_source = \"GCP Cloud Audit\"\n    platform = \"GCP\"\n    severity = \"High\"\n    \n  events:\n    $gcp.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    (\n        $gcp.metadata.product_event_type = \"DestroyCryptoKeyVersion\" or\n        (\n            $gcp.metadata.product_event_type = \"UpdateCryptoKeyVersion\" and\n            $gcp.target.resource.attribute.labels[\"req_cryptokey_version_state\"] = \"DISABLED\"\n        )\n    )\n    $gcp.target.application = \"cloudkms.googleapis.com\"\n    $gcp.security_result.action = \"ALLOW\"\n    $gcp.target.user.userid = $user_id\n\n  match:\n    $user_id over 1h\n\n  outcome:\n    $risk_score = max(75)\n    $mitre_attack_tactic = \"Impact\"\n    $mitre_attack_technique = \"Data Destruction\"\n    $mitre_attack_technique_id = \"T1485\"\n    $event_count = count_distinct($gcp.metadata.id)\n    $network_http_user_agent = array_distinct($gcp.network.http.user_agent)\n    $principal_ip = array_distinct($gcp.principal.ip)\n    $principal_ip_country = array_distinct($gcp.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($gcp.principal.ip_geo_artifact.location.state)\n    $principal_user_id = array_distinct($gcp.principal.user.userid)\n    $principal_user_display_name = array_distinct($gcp.principal.user.user_display_name)\n    $target_resource_name = array_distinct($gcp.target.resource.name)\n\n  condition:\n    #gcp >= 10\n}\n", "versionCreateTime": "2024-06-19T11:07:39.805609Z", "compilationState": "SUCCEEDED", "ruleType": "MULTI_EVENT", "lastAlertStatusChangeTime": "2024-06-19T08:22:05.927583Z"}