{"ruleId": "ru_87bc1812-936a-454e-8e41-4669947d1eb0", "versionId": "ru_87bc1812-936a-454e-8e41-4669947d1eb0@v_1718793340_328255000", "ruleName": "gcp_security_command_center_service_disabled", "metadata": {"data_source": "GCP Cloud Audit", "platform": "GCP", "severity": "High", "name": "gcp_security_command_center_service_disabled", "author": "Deloitte", "description": "Detects when GCP Security Command Center services are disabled.", "mitre_attack_tactic": "Defense Evasion", "mitre_attack_technique": "Impair Defenses"}, "ruleText": " rule gcp_security_command_center_service_disabled {\n\n  meta:\n    name= \"gcp_security_command_center_service_disabled\"\n    author = \"Deloitte\"\n    description = \"Detects when GCP Security Command Center services are disabled.\"\n    mitre_attack_tactic = \"Defense Evasion\"\n    mitre_attack_technique = \"Impair Defenses\"\n    data_source = \"GCP Cloud Audit\"\n    platform = \"GCP\"\n    severity = \"High\"\n\n  events:\n    $gcp.metadata.event_type = \"RESOURCE_WRITTEN\"\n    $gcp.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $gcp.metadata.product_event_type = /google.cloud.securitycenter.settings.*.Settings.Update/\n    $gcp.security_result.action = \"ALLOW\"\n    $gcp.target.application = \"securitycenter.googleapis.com\"\n    $gcp.target.resource.attribute.labels[\"service_enablement_state\"] = \"DISABLED\"\n\n  outcome:\n    $risk_score = max(75)\n    $mitre_attack_tactic = \"Defense Evasion\"\n    $mitre_attack_technique = \"Impair Defenses\"\n    $mitre_attack_technique_id = \"T1562\"\n    $event_count = count_distinct($gcp.metadata.id)\n    $network_http_user_agent = $gcp.network.http.user_agent\n    $principal_ip = array_distinct($gcp.principal.ip)\n    $principal_ip_country = array_distinct($gcp.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($gcp.principal.ip_geo_artifact.location.state)\n    $principal_user_id = $gcp.principal.user.userid\n    $principal_user_display_name = $gcp.principal.user.user_display_name\n    $target_resource_name = $gcp.target.resource.name\n\n  condition:\n    $gcp\n}\n", "versionCreateTime": "2024-06-19T10:35:40.328255Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-19T08:14:38.955567Z"}