{"ruleId": "ru_c529cc6a-a21f-4db2-80fc-1aa3011dd1f7", "versionId": "ru_c529cc6a-a21f-4db2-80fc-1aa3011dd1f7@v_1721674909_200367000", "ruleName": "GCP_Project_Create", "metadata": {"author": "Deloitte", "description": "This rule detect every time project created in GCP", "severity": "Low", "mitre_technique": "{NA: Not Applicable}", "mitre_tactic": "{NA: Not Applicable}", "name": "GCP_Project_Create"}, "ruleText": "rule GCP_Project_Create \n{\n  meta:\n    name = \"GCP_Project_Create\"\n    author = \"Deloitte\"\n    description = \"This rule detect every time project created in GCP\"\n    severity = \"Low\"\n    mitre_technique = \"{NA: Not Applicable}\"\n    mitre_tactic = \"{NA: Not Applicable}\"\n\n  events:\n  $e.metadata.log_type = \"GCP_CLOUDAUDIT\"\n  $e.metadata.product_event_type = \"CreateProject\"\n  $e.metadata.product_name = \"Google Cloud Platform\"\n  $e.metadata.vendor_name = \"Google Cloud Platform\"\n\n\n\n  condition:\n    $e\n}\n", "alertingEnabled": true, "liveRuleEnabled": true, "versionCreateTime": "2024-07-22T19:01:49.200367Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-07-28T18:13:18.158397Z"}