{"ruleId": "ru_cd36aef4-5623-4dd4-a476-791a6a85dac3", "versionId": "ru_cd36aef4-5623-4dd4-a476-791a6a85dac3@v_1718794409_524778000", "ruleName": "GCP_gce_image_open_to_public", "metadata": {"severity": "High", "name": "GCP_gce_image_open_to_public", "author": "Deloitte", "description": "This rule id detect when GCP Compute Image is opened to public by adding allAuthenticatedUsers to the access policy.", "mitre_attack_tactic": "Exfiltration", "mitre_attack_technique": "Transfer Data to Cloud Account", "data_source": "GCP Cloud Audit", "platform": "GCP"}, "ruleText": "rule GCP_gce_image_open_to_public \n{\n\n  meta:\n    name= \"GCP_gce_image_open_to_public\"\n    author = \"Deloitte\"\n    description = \"This rule id detect when GCP Compute Image is opened to public by adding allAuthenticatedUsers to the access policy.\"\n    mitre_attack_tactic = \"Exfiltration\"\n    mitre_attack_technique = \"Transfer Data to Cloud Account\"\n    data_source = \"GCP Cloud Audit\"\n    platform = \"GCP\"\n    severity = \"High\"\n\n  events:\n    $gcp.metadata.event_type = \"USER_RESOURCE_UPDATE_PERMISSIONS\"\n    $gcp.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $gcp.metadata.vendor_name = \"Google Cloud Platform\"\n    $gcp.metadata.product_event_type = \"beta.compute.images.setIamPolicy\"\n    $gcp.target.application = \"compute.googleapis.com\"\n    $gcp.security_result.action = \"ALLOW\"\n    any $gcp.target.resource.attribute.labels.value = \"allAuthenticatedUsers\"\n    $gcp.target.resource.resource_subtype = \"gce_image\"\n\n  outcome:\n    $risk_score = max(75)\n    $mitre_attack_tactic = \"Exfiltration\"\n    $mitre_attack_technique = \"Transfer Data to Cloud Account\"\n    $mitre_attack_technique_id = \"T1537\"\n    $event_count = count_distinct($gcp.metadata.id)\n    $network_http_user_agent = array_distinct($gcp.network.http.user_agent)\n    $principal_ip = array_distinct($gcp.principal.ip)\n    $principal_ip_country = array_distinct($gcp.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($gcp.principal.ip_geo_artifact.location.state)\n    $principal_user_id = $gcp.principal.user.userid\n    $principal_user_display_name = $gcp.principal.user.user_display_name\n    $target_resource_name = $gcp.target.resource.name\n    $event_name = $gcp.metadata.product_event_type\n    $target_email_addresses = array_distinct($gcp.target.user.email_addresses)\n\n  condition:\n    $gcp\n}\n", "versionCreateTime": "2024-06-19T10:53:29.524778Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-19T10:50:29.976831Z"}