{"ruleId": "ru_f00c1019-19e6-4667-8930-630f759db9be", "versionId": "ru_f00c1019-19e6-4667-8930-630f759db9be@v_1719414946_804367000", "ruleName": "GCP_API_Key_not_rotated", "metadata": {"description": "This rule detects when API Key is not rotated in production environment", "severity": "Medium", "name": "GCP_API_Key_not_rotated", "author": "Deloitte"}, "ruleText": "rule GCP_API_Key_not_rotated \n{\n\n  meta:\n    name = \"GCP_API_Key_not_rotated\"\n    author = \"Deloitte\"\n    description = \"This rule detects when API Key is not rotated in production environment\"\n    severity = \"Medium\"\n\n  events:\n    $e.metadata.log_type = \"GCP_SECURITYCENTER_MISCONFIGURATION\"\n    $e.metadata.product_event_type = \"API_KEY_NOT_ROTATED\"\n    $e.metadata.product_name = \"Security Command Center\"\n    $e.metadata.vendor_name = \"Google\"\n    $e.security_result.category_details = \"MISCONFIGURATION\"\n    $e.target.resource.attribute.labels[\"resource_parentDisplayName\"] = \"Production\"\n\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-06-26T15:15:46.804367Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-26T15:15:46.804367Z"}