{"ruleId": "ru_0b9c7e81-3634-4a8d-849a-49f7490eaa07", "versionId": "ru_0b9c7e81-3634-4a8d-849a-49f7490eaa07@v_1719744901_642351000", "ruleName": "GCP_MFA_Not_enforced", "metadata": {"author": "Deloitte", "description": "This rule idetifies MFF not enforced in domain Cyber.gov.il", "severity": "Medium"}, "ruleText": "rule GCP_MFA_Not_enforced \n{\n\n  meta:\n    author = \"Deloitte\"\n    description = \"This rule idetifies MFF not enforced in domain Cyber.gov.il\"\n    severity = \"Medium\"\n\n  events:\n    $e.metadata.event_type = \"GENERIC_EVENT\"\n    $e.metadata.log_type = \"GCP_SECURITYCENTER_MISCONFIGURATION\"\n    $e.metadata.product_event_type = \"MFA_NOT_ENFORCED\"\n    $e.metadata.product_name = \"Security Command Center\"\n    $e.metadata.vendor_name = \"Google\"\n    $e.target.resource.attribute.labels[\"resource_displayName\"]= \"cyber.gov.il\"\n    $e.additional.fields[\"sourceProperties_ScannerName\"] = \"MFA_SCANNER\"\n\n\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-06-30T10:55:01.642351Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-30T10:55:01.642351Z"}