{"ruleId": "ru_3aa627da-a6c8-4cbc-877b-f60414bd6b18", "versionId": "ru_3aa627da-a6c8-4cbc-877b-f60414bd6b18@v_1719321033_122031000", "ruleName": "GCP_Firewall_Rule_Opened_to_World", "metadata": {"severity": "High", "mitre_tactic": "Defense Evasion", "mitre_technique": "Impair Defenses", "name": "GCP_Firewall_Rule_Opened_to_World", "author": "Deloitte", "description": "This rule detects when a GCP Firewall rule is opened to the world (0.0.0.0/0) on all protocols"}, "ruleText": " rule GCP_Firewall_Rule_Opened_to_World \n{\n  meta:\n    name = \"GCP_Firewall_Rule_Opened_to_World\"\n    author = \"Deloitte\"\n    description = \"This rule detects when a GCP Firewall rule is opened to the world (0.0.0.0/0) on all protocols\"\n    severity = \"High\"\n    mitre_tactic = \"Defense Evasion\"\n    mitre_technique = \"Impair Defenses\"\n\n\n  events:\n    $e.metadata.event_type = \"RESOURCE_CREATION\"\n    $e.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $e.metadata.product_name = \"Google Compute Engine\"\n    $e.metadata.product_event_type = \"beta.compute.firewalls.insert\"\n    $e.principal.user.attribute.permissions.name = \"compute.networks.updatePolicy\"\n    $e.principal.user.email_addresses = $source_who_did_the_change\n    $e.target.resource_ancestors.resource_type = \"FIREWALL_RULE\"\n    $e.target.resource.attribute.labels[\"source_ranges\"] = \"0.0.0.0\"\n    $e.target.resource.resource_subtype = \"gce_firewall_rule\"\n    $e.target.resource.resource_type = \"FIREWALL_RULE\"\n    $e.target.resource_ancestors.resource_type = \"FIREWALL_RULE\"\n    $e.target.resource.attribute.labels[\"response_operation_type\"] = \"insert\"\n    $e.target.resource.attribute.labels[\"response_status\"] = \"RUNNING\"\n    $e.security_result.action = \"ALLOW\"\n\n\n    $e.security_result.detection_fields[\"allowed_ipprotocol\"] = \"all\" or $e.security_result.detection_fields[\"allowed_ipprotocol\"] = \"tcp\"\n\n\n\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-06-25T13:10:33.122031Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-22T18:18:13.182111Z"}