{"ruleId": "ru_75743109-7bc2-4b35-a25c-94d902e0e423", "versionId": "ru_75743109-7bc2-4b35-a25c-94d902e0e423@v_1718794033_985311000", "ruleName": "GCP_exempt_principals_from_audit_log", "metadata": {"mitre_attack_technique": "Impair Defenses: Disable Cloud Logs", "severity": "High", "name": "GCP_exempt_principals_from_audit_log", "author": "Deloitte", "description": "This rule detect when GCP Cloud Audit logs are exempted for principals in all services at project or organization level. Audit logging helps organizations maintain security and minimize risk.", "mitre_attack_tactic": "Defense Evasion"}, "ruleText": "rule GCP_exempt_principals_from_audit_log  \n{\n\n  meta:\n    name = \"GCP_exempt_principals_from_audit_log\" \n    author = \"Deloitte\"\n    description = \"This rule detect when GCP Cloud Audit logs are exempted for principals in all services at project or organization level. Audit logging helps organizations maintain security and minimize risk.\"\n    mitre_attack_tactic = \"Defense Evasion\"\n    mitre_attack_technique = \"Impair Defenses: Disable Cloud Logs\"\n    severity = \"High\"\n\n  events:\n    $gcp.metadata.event_type = \"USER_RESOURCE_UPDATE_PERMISSIONS\"\n    $gcp.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $gcp.metadata.product_event_type = \"SetIamPolicy\"\n    $gcp.security_result.action = \"ALLOW\"\n    $gcp.target.application = \"cloudresourcemanager.googleapis.com\"\n    any $gcp.target.resource.attribute.labels.value = \"ADD\"\n    any $gcp.target.resource.attribute.labels.value = \"allServices\"\n    any $gcp.target.resource.attribute.labels.key = /service_data_policy_delta_audit_config_delta_.*_exempted_member/\n\n  outcome:\n    $risk_score = max(45 +\n      if($gcp.target.resource.name = /organizations/,30,0)\n    )\n    $mitre_attack_tactic = \"Defense Evasion\"\n    $mitre_attack_technique = \"Impair Defenses: Disable Cloud Logs\"\n    $mitre_attack_technique_id = \"T1562.008\"\n    $event_count = count_distinct($gcp.metadata.id)\n    $network_http_user_agent = array_distinct($gcp.network.http.user_agent)\n    $principal_ip = array_distinct($gcp.principal.ip)\n    $principal_ip_country = array_distinct($gcp.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($gcp.principal.ip_geo_artifact.location.state)\n    $principal_user_id = $gcp.principal.user.userid\n    $principal_user_display_name = $gcp.principal.user.user_display_name\n    $target_resource_name = $gcp.target.resource.name\n    $event_name = $gcp.metadata.product_event_type\n\n  condition:\n    $gcp\n}\n", "versionCreateTime": "2024-06-19T10:47:13.985311Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-19T08:56:32.735439Z"}