{"ruleId": "ru_c5f7809c-5f2a-4e49-9ceb-e0049d2c86a1", "versionId": "ru_c5f7809c-5f2a-4e49-9ceb-e0049d2c86a1@v_1719321176_246143000", "ruleName": "GCP_firewall_rule_modified_or_deleted", "metadata": {"mitre_attack_technique": "Impair Defenses: Disable or Modify System Firewall", "data_source": "GCP Audit", "platform": "GCP", "severity": "Medium", "name": "GCP_firewall_rule_modified_or_deleted", "author": "Deloitte", "description": "This rule detects when a firewall rule is modified or deleted in Google Cloud Platform.", "mitre_attack_tactic": "Defense Evasion"}, "ruleText": " rule GCP_firewall_rule_modified_or_deleted\n {\n\n  meta:\n    name= \"GCP_firewall_rule_modified_or_deleted\"\n    author = \"Deloitte\"\n    description = \"This rule detects when a firewall rule is modified or deleted in Google Cloud Platform.\"\n    mitre_attack_tactic = \"Defense Evasion\"\n    mitre_attack_technique = \"Impair Defenses: Disable or Modify System Firewall\"\n    data_source = \"GCP Audit\"\n    platform = \"GCP\"\n    severity = \"Medium\"\n\n  events:\n    //Firewall rule deletion\n    $e.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $e.metadata.event_type = \"RESOURCE_DELETION\"\n    $e.metadata.vendor_name = \"Google Cloud Platform\"\n    $e.metadata.product_name = \"Google Compute Engine\"\n    $e.metadata.product_event_type = \"v1.compute.firewalls.delete\"\n    $e.target.resource.attribute.labels[\"request_type\"] = \"type.googleapis.com/compute.firewalls.delete\"\n    $e.target.resource.resource_subtype = \"gce_firewall_rule\"\n    $e.target.resource.resource_type = \"FIREWALL_RULE\"\n    $e.target.resource.attribute.labels[\"response_operation_type\"] = \"delete\"\n    $e.security_result.action = \"ALLOW\"\n\n\nor\n\n    //Firewall rule modification\n    $e.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $e.metadata.event_type = \"RESOURCE_CREATION\"\n    $e.metadata.product_name = \"Google Compute Engine\"\n    $e.metadata.product_event_type = \"beta.compute.firewalls.insert\"\n    $e.target.resource.attribute.labels[\"request_type\"] = \"type.googleapis.com/compute.firewalls.insert\"\n    $e.target.resource.resource_subtype = \"gce_firewall_rule\"\n    $e.target.resource.resource_type = \"FIREWALL_RULE\"\n    $e.security_result.action = \"ALLOW\"\n\n\n\n  outcome:\n    $risk_score = max(75)\n    $mitre_attack_tactic = \"Defense Evasion\"\n    $mitre_attack_technique = \"Impair Defenses: Disable or Modify System Firewall\"\n    $mitre_attack_technique_id = \"T1562.004\"\n    $event_count = count_distinct($e.metadata.id)\n    $network_http_user_agent = array_distinct($e.network.http.user_agent)\n    $principal_ip = array_distinct($e.principal.ip)\n    $principal_ip_country = array_distinct($e.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($e.principal.ip_geo_artifact.location.state)\n    $principal_user_display_name = array_distinct($e.principal.user.user_display_name)\n    $recipient_aws_account_id = array_distinct($e.target.resource.attribute.labels[\"Recipient Account Id\"])\n    $aws_region = array_distinct($e.principal.location.name)\n    $target_resource_name = array_distinct($e.target.resource.name)\n    $target_resource_product_object_id = array_distinct($e.target.resource.product_object_id)\n\n  condition:\n    $e\n}\n", "alertingEnabled": true, "liveRuleEnabled": true, "versionCreateTime": "2024-06-25T13:12:56.246143Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-07-28T18:44:15.043894Z"}