{"ruleId": "ru_4d05915c-91ff-4013-8551-995fc9d6bfd0", "versionId": "ru_4d05915c-91ff-4013-8551-995fc9d6bfd0@v_1719413098_706319000", "ruleName": "GCP_service_account_disabled_or_deleted", "metadata": {"mitre_attack_tactic": "Impact", "mitre_attack_technique": "Account Access Removal", "name": "GCP_service_account_disabled_or_deleted", "author": "Deloitte", "description": "This rule identifies when a service account is disabled or deleted in Google Cloud.", "severity": "Medium"}, "ruleText": " rule GCP_service_account_disabled_or_deleted \n {\n\n  meta:\n    name= \"GCP_service_account_disabled_or_deleted\"\n    author = \"Deloitte\"\n    description = \"This rule identifies when a service account is disabled or deleted in Google Cloud.\"\n    severity = \"Medium\"\n    mitre_attack_tactic = \"Impact\"\n    mitre_attack_technique = \"Account Access Removal\"\n\n  events:   \n\n        $e.metadata.vendor_name = \"Google Cloud Platform\"\n        $e.target.resource.resource_type = \"SERVICE_ACCOUNT\" \n        $e.metadata.log_type = \"GCP_CLOUDAUDIT\"\n        $e.metadata.product_name = \"Google Cloud IAM\"\n        $e.target.application = \"iam.googleapis.com\"\n\n      (  \n       ($e.metadata.event_type = \"RESOURCE_WRITTEN\" and $e.metadata.product_event_type = \"google.iam.admin.v1.DisableServiceAccount\") or \n       ($e.metadata.event_type = \"USER_RESOURCE_DELETION\" and $e.metadata.product_event_type = \"google.iam.admin.v1.DeleteServiceAccount\")\n      )\n\n  condition:\n    $e \n}\n", "versionCreateTime": "2024-06-26T14:44:58.706319Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-19T12:12:47.961823Z"}