{"ruleId": "ru_09b24633-1ce5-4c49-afc9-4a904cae17b5", "versionId": "ru_09b24633-1ce5-4c49-afc9-4a904cae17b5@v_1719405702_746447000", "ruleName": "GCP_SCC_service_enabled", "metadata": {"author": "Deloitte", "description": "This rule idetifies when SCC service is enabled in GCP environment", "severity": "Medium"}, "ruleText": "rule GCP_SCC_service_enabled\n{\n//This rule need to be simulated in GCP environment********\n\n\n\n  meta:\n    author = \"Deloitte\"\n    description = \"This rule idetifies when SCC service is enabled in GCP environment\"\n    severity = \"Medium\"\n\n\n  events:\n\n  //SCC Enabled\n    $e.metadata.event_type = \"GENERIC_EVENT\"\n    $e.metadata.vendor_name = \"Google\"\n    $e.metadata.log_type = \"GCP_SECURITYCENTER_MISCONFIGURATION\"\n    $e.metadata.product_event_type = \"DEFAULT_SERVICE_ACCOUNT_USED\"\n    $e.metadata.product_name = \"Security Command Center\"\n    $e.security_result.detection_fields[\"state\"] = \"ACTIVE\" \n    $e.target.application = \"compute.googleapis.com\"\n\n\n\n  outcome:\n    // For a multi-event rule an aggregation function is required\n    // e.g., risk_score = max(0)\n    // See https://cloud.google.com/chronicle/docs/detection/yara-l-2-0-overview#outcome_conditionals_example_rule\n    $risk_score = 0\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-06-26T12:41:42.746447Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-26T12:41:42.746447Z"}