{"ruleId": "ru_f8898824-5ab2-4b27-ad7e-e22074110aec", "versionId": "ru_f8898824-5ab2-4b27-ad7e-e22074110aec@v_1718796771_245039000", "ruleName": "GCP_service_account_key_used_from_multiple_countries", "metadata": {"data_source": "GCP Cloud Audit", "platform": "GCP", "severity": "Low", "author": "Deloitte", "description": "Detects usage of service account key from multiple countries using Chronicle GeoIP enrichment.", "mitre_attack_tactic": "Credential Access", "mitre_attack_technique": "Unsecured Credentials: Private Keys"}, "ruleText": "rule GCP_service_account_key_used_from_multiple_countries {\n\n  meta:\n    author = \"Deloitte\"\n    description = \"Detects usage of service account key from multiple countries using Chronicle GeoIP enrichment.\"\n    mitre_attack_tactic = \"Credential Access\"\n    mitre_attack_technique = \"Unsecured Credentials: Private Keys\"\n    data_source = \"GCP Cloud Audit\"\n    platform = \"GCP\"\n    severity = \"Low\"\n\n events:\n    $gcp.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $gcp.security_result.action = \"ALLOW\"\n    $gcp.principal.ip_geo_artifact.location.country_or_region != \"\"\n    $gcp.principal.ip_geo_artifact.network.organization_name != /google/\n    $gcp.security_result.detection_fields[\"key_id\"] = $sa_key_id\n\n  match:\n    $sa_key_id over 1h\n\n  outcome:\n    $risk_score = max(35)\n    $mitre_attack_tactic = \"Credential Access\"\n    $mitre_attack_technique = \"Unsecured Credentials: Private Keys\"\n    $mitre_attack_technique_id = \"T1552.004\"\n    $event_count = count_distinct($gcp.metadata.id)\n    $network_http_user_agent = array_distinct($gcp.network.http.user_agent)\n    $principal_ip = array_distinct($gcp.principal.ip)\n    $principal_ip_country = array_distinct($gcp.principal.ip_geo_artifact.location.country_or_region)\n    $dc_principal_ip_country = count_distinct($gcp.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($gcp.principal.ip_geo_artifact.location.state)\n    $principal_user_display_name = array_distinct($gcp.principal.user.user_display_name)\n    $target_resource_name = array_distinct($gcp.target.resource.name)\n    $sa_key_name = array_distinct($gcp.security_result.detection_fields[\"service_account_key_name\"])\n\n  condition:\n    $gcp and $dc_principal_ip_country > 2\n}\n", "versionCreateTime": "2024-06-19T11:32:51.245039Z", "compilationState": "SUCCEEDED", "ruleType": "MULTI_EVENT", "lastAlertStatusChangeTime": "2024-06-19T11:32:51.245039Z"}