{"ruleId": "ru_8cee4302-4c6f-411d-9bdf-7f8cfc2319b7", "versionId": "ru_8cee4302-4c6f-411d-9bdf-7f8cfc2319b7@v_1718802080_689973000", "ruleName": "GCP_kms_key_modified", "metadata": {"platform": "GCP", "severity": "High", "name": "GCP_kms_key_modified", "author": "Deloitte", "description": "Detect when a KMS key is modified from GCP Cloud KMS.", "mitre_attack_tactic": "Impact", "mitre_attack_technique": "Data Destruction", "data_source": "GCP Cloud Audit"}, "ruleText": "rule GCP_kms_key_modified {\n\n  meta:\n    name=\"GCP_kms_key_modified\"\n    author = \"Deloitte\"\n    description = \"Detect when a KMS key is modified from GCP Cloud KMS.\"\n    mitre_attack_tactic = \"Impact\"\n    mitre_attack_technique = \"Data Destruction\"\n    data_source = \"GCP Cloud Audit\"\n    platform = \"GCP\"\n    severity = \"High\"\n    \n  events:\n    $gcp.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    (\n        $gcp.metadata.product_event_type = \"DestroyCryptoKeyVersion\" or\n        $gcp.metadata.product_event_type = \"UpdateCryptoKeyVersion\" or\n        $gcp.metadata.product_event_type = \"DisableKeyVersion\" or\n        $gcp.metadata.product_event_type = \"EnableKeyVersion\" or\n        $gcp.metadata.product_event_type = \"CreateKeyLabels\" or\n        $gcp.metadata.product_event_type = \"CreateKeyRing\" or\n        $gcp.metadata.product_event_type = \"CreateKeyForImport\" or\n        $gcp.metadata.product_event_type = \"CreateKeyVersion\" or\n        $gcp.metadata.product_event_type = \"CreateKeySymmetricEncryptDecrypt\" or\n        $gcp.metadata.product_event_type = \"CreateKeyAsymmetricDecrypt\" or\n        $gcp.metadata.product_event_type = \"CreateKeyAsymmetricSign\" or\n        $gcp.metadata.product_event_type = \"CreateKeyMac\" or\n        $gcp.metadata.product_event_type = \"CreateKeyHsm\" or\n        $gcp.metadata.product_event_type = \"RestoreKeyVersion\" or\n        $gcp.metadata.product_event_type = \"UpdateKeySetPrimary\" or\n        $gcp.metadata.product_event_type = \"UpdateKeyUpdateLabels\" or\n        $gcp.metadata.product_event_type = \"ImportCryptoKeyVersion\" or\n        $gcp.metadata.product_event_type = \"CreateKeyHsm\" \n    )\n    $gcp.target.application = \"cloudkms.googleapis.com\"\n    $gcp.security_result.action = \"ALLOW\"\n    $gcp.target.user.userid = $user_id\n\n  match:\n    $user_id over 1h\n\n  outcome:\n    $risk_score = max(75)\n    $mitre_attack_tactic = \"Impact\"\n    $mitre_attack_technique = \"Data Destruction\"\n    $mitre_attack_technique_id = \"T1485\"\n    $event_count = count_distinct($gcp.metadata.id)\n    $network_http_user_agent = array_distinct($gcp.network.http.user_agent)\n    $principal_ip = array_distinct($gcp.principal.ip)\n    $principal_ip_country = array_distinct($gcp.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($gcp.principal.ip_geo_artifact.location.state)\n    $principal_user_id = array_distinct($gcp.principal.user.userid)\n    $principal_user_display_name = array_distinct($gcp.principal.user.user_display_name)\n    $target_resource_name = array_distinct($gcp.target.resource.name)\n\n  condition:\n    $gcp \n}\n", "versionCreateTime": "2024-06-19T13:01:20.689973Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-19T08:46:44.202943Z"}