{"ruleId": "ru_d16f764f-18c4-437d-b682-9b7fcf5a7556", "versionId": "ru_d16f764f-18c4-437d-b682-9b7fcf5a7556@v_1718794747_892863000", "ruleName": "GCP_iam_organization_policy_updated_or_deleted", "metadata": {"mitre_attack_tactic": "Persistence, Privilege Escalation", "mitre_attack_technique": "Account Manipulation", "data_source": "GCP Cloud Audit", "platform": "GCP", "severity": "High", "name": "GCP_iam_organization_policy_updated_or_deleted", "author": "Deloitte", "description": "Detect when GCP IAM Organization Policy is updated or deleted."}, "ruleText": " rule GCP_iam_organization_policy_updated_or_deleted \n {\n\n  meta:\n    name = \"GCP_iam_organization_policy_updated_or_deleted\"\n    author = \"Deloitte\"\n    description = \"Detect when GCP IAM Organization Policy is updated or deleted.\"\n    mitre_attack_tactic = \"Persistence, Privilege Escalation\"\n    mitre_attack_technique = \"Account Manipulation\"\n    data_source = \"GCP Cloud Audit\"\n    platform = \"GCP\"\n    severity = \"High\"\n\n  events:\n    $gcp.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    (\n        ($gcp.metadata.event_type = \"RESOURCE_WRITTEN\" and $gcp.metadata.product_event_type = \"google.cloud.orgpolicy.v2.OrgPolicy.UpdatePolicy\") or\n        ($gcp.metadata.event_type = \"RESOURCE_DELETION\" and $gcp.metadata.product_event_type = \"google.cloud.orgpolicy.v2.OrgPolicy.DeletePolicy\")\n    )\n    $gcp.security_result.action = \"ALLOW\"\n    $gcp.target.application = \"orgpolicy.googleapis.com\"\n\n  outcome:\n    $risk_score = max(75)\n    $mitre_attack_tactic = \"Persistence, Privilege Escalation\"\n    $mitre_attack_technique = \"Account Manipulation\"\n    $mitre_attack_technique_id = \"T1098\"\n    $event_count = count_distinct($gcp.metadata.id)\n    $network_http_user_agent = array_distinct($gcp.network.http.user_agent)\n    $principal_ip = array_distinct($gcp.principal.ip)\n    $principal_ip_country = array_distinct($gcp.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($gcp.principal.ip_geo_artifact.location.state)\n    $principal_user_id = $gcp.principal.user.userid\n    $principal_user_display_name = $gcp.principal.user.user_display_name\n    $target_resource_name = $gcp.target.resource.name\n    $event_name = $gcp.metadata.product_event_type\n\n  condition:\n    $gcp\n}\n", "versionCreateTime": "2024-06-19T10:59:07.892863Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-19T10:54:20.529647Z"}