{"ruleId": "ru_7bae704d-e1c9-42a7-9cba-c2424ef743b4", "versionId": "ru_7bae704d-e1c9-42a7-9cba-c2424ef743b4@v_1719167418_158639000", "ruleName": "GCP_service_api_key_retrieved", "metadata": {"platform": "GCP", "mitre_attack_tactic": "Credential Access", "mitre_attack_technique": "Credentials from Password Stores", "type": "Alert", "author": "Google Cloud Security", "priority": "High", "mitre_attack_url": "https://attack.mitre.org/techniques/T1555/", "mitre_attack_version": "v14.1", "data_source": "GCP Cloud Audit", "severity": "High", "description": "Detects a successful attempt to retrieve the service API Keys."}, "ruleText": "\n\n rule GCP_service_api_key_retrieved {\n\n  meta:\n    author = \"Google Cloud Security\"\n    description = \"Detects a successful attempt to retrieve the service API Keys.\"\n    mitre_attack_tactic = \"Credential Access\"\n    mitre_attack_technique = \"Credentials from Password Stores\"\n    mitre_attack_url = \"https://attack.mitre.org/techniques/T1555/\"\n    mitre_attack_version = \"v14.1\"\n    type = \"Alert\"\n    data_source = \"GCP Cloud Audit\"\n    platform = \"GCP\"\n    severity = \"High\"\n    priority = \"High\"\n\n  events:\n    $gcp.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $gcp.metadata.product_event_type = \"google.api.apikeys.v2.ApiKeys.GetKeyString\"\n    $gcp.target.application = \"apikeys.googleapis.com\"\n    $gcp.security_result.action = \"ALLOW\"\n    $gcp.principal.user.userid = $userid\n\n  match:\n    $userid over 1h\n\n  outcome:\n    $risk_score = max(75)\n    $mitre_attack_tactic = \"Credential Access\"\n    $mitre_attack_technique = \"Credentials from Password Stores\"\n    $mitre_attack_technique_id = \"T1555\"\n    $event_count = count_distinct($gcp.metadata.id)\n    $network_http_user_agent = array_distinct($gcp.network.http.user_agent)\n    $principal_ip = array_distinct($gcp.principal.ip)\n    $principal_ip_country = array_distinct($gcp.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($gcp.principal.ip_geo_artifact.location.state)\n    $principal_user_id = array_distinct($gcp.principal.user.userid)\n    $principal_user_display_name = array_distinct($gcp.principal.user.user_display_name)\n    $target_resource_name = array_distinct($gcp.target.resource.name)\n    $dc_target_resource_name = count_distinct($gcp.target.resource.name)\n\n  condition:\n    $gcp\n}\n", "versionCreateTime": "2024-06-23T18:30:18.158639Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-23T18:30:09.394655Z"}