{"ruleId": "ru_f40b5481-57b6-4b22-9b54-5b90120ec8e8", "versionId": "ru_f40b5481-57b6-4b22-9b54-5b90120ec8e8@v_1719405716_386367000", "ruleName": "GCP_SCC_service_disabled", "metadata": {"author": "Deloitte", "description": "This rule idetifies when SCC service is disabled in GCP environment", "severity": "High"}, "ruleText": "rule GCP_SCC_service_disabled\n{\n\n  meta:\n    author = \"Deloitte\"\n    description = \"This rule idetifies when SCC service is disabled in GCP environment\"\n    severity = \"High\"\n\n  events:\n    //SCC Disabled\n    $e.metadata.log_type = \"GCP_SECURITYCENTER_MISCONFIGURATION\"\n    $e.metadata.product_event_type = \"COMPUTE_SECURE_BOOT_DISABLED\"\n    $e.metadata.product_name = \"Security Command Center\"\n    $e.metadata.vendor_name = \"Google\"\n    $e.security_result.category_details = \"MISCONFIGURATION\"\n    $e.security_result.detection_fields[\"state\"] = \"INACTIVE\"\n    $e.target.application = \"compute.googleapis.com\"\n\n\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-06-26T12:41:56.386367Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-26T12:41:56.386367Z"}