{"ruleId": "ru_7aa121dc-0944-4710-abd0-64c5bf4120c9", "versionId": "ru_7aa121dc-0944-4710-abd0-64c5bf4120c9@v_1719746863_642719000", "ruleName": "GCP_audit_logging_removed_from_a_service", "metadata": {"author": "Deloitte", "description": "This rule identifies when a GCP cloud audit logging removed from a service", "severity": "Medium"}, "ruleText": "rule GCP_audit_logging_removed_from_a_service\n{\n\n  meta:\n    author = \"Deloitte\"\n    description = \"This rule identifies when a GCP cloud audit logging removed from a service\"\n    severity = \"Medium\"\n\n  events:\n    $e.metadata.event_type = \"USER_RESOURCE_UPDATE_PERMISSIONS\"\n    $e.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $e.metadata.product_event_type = \"SetIamPolicy\"\n    $e.metadata.product_name = \"Google Cloud Platform\"\n    $e.security_result.action = \"ALLOW\"\n    $e.security_result.detection_fields[\"action\"] = \"REMOVE\"\n    $e.principal.user.attribute.labels[\"authorization_info_resourceService\"]= \"cloudresourcemanager.googleapis.com\"\n\n\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-06-30T11:27:43.642719Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-26T13:05:21.779071Z"}