{"ruleId": "ru_e14ad18f-f765-433c-9b61-b45280f94906", "versionId": "ru_e14ad18f-f765-433c-9b61-b45280f94906@v_1719412135_418127000", "ruleName": "GCP_Service_Account_created", "metadata": {"severity": "Medium", "author": "Deloitte", "description": "This rule detects when a service account created"}, "ruleText": "rule GCP_Service_Account_created {\n\n  meta:\n    author = \"Deloitte\"\n    description = \"This rule detects when a service account created\"\n    severity = \"Medium\"\n\n  events:\n    //Service Account Creation\n    $e.metadata.event_type = \"USER_RESOURCE_CREATION\"\n    $e.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $e.metadata.product_event_type = \"google.iam.admin.v1.CreateServiceAccount\"\n    $e.metadata.product_name = \"Google Cloud IAM\"\n    $e.target.application = \"iam.googleapis.com\"\n    $e.target.resource_ancestors.resource_type = \"SERVICE_ACCOUNT\"\n    $e.target.resource.attribute.labels[\"request_type\"] = \"type.googleapis.com/google.iam.admin.v1.CreateServiceAccountRequest\"\n    $e.target.resource.resource_subtype = \"service_account\"\n    $e.target.resource.resource_type = \"SERVICE_ACCOUNT\"\n\n\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-06-26T14:28:55.418127Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-26T14:28:55.418127Z"}