{"ruleId": "ru_93bbb1d1-56c6-4d6e-8b61-4e6ff0296a27", "versionId": "ru_93bbb1d1-56c6-4d6e-8b61-4e6ff0296a27@v_1719392559_754703000", "ruleName": "GCP_admin_privileged_roles_added_to_service_accounts", "metadata": {"mitre_technique": "Account Manipulation: Additional Cloud Roles", "name": "GCP_admin_privileged_roles_added_to_service_accounts", "author": "Deloitte", "description": "This rule detect when admin privileged roles such as Owner or Editor are added to a Service Account.", "severity": "Medium", "mitre_tactic": "Persistence, Privilege Escalation"}, "ruleText": "rule GCP_admin_privileged_roles_added_to_service_accounts\n{\n\n  meta:\n    name = \"GCP_admin_privileged_roles_added_to_service_accounts\"\n    author = \"Deloitte\"\n    description = \"This rule detect when admin privileged roles such as Owner or Editor are added to a Service Account.\"\n    severity = \"Medium\"\n    mitre_tactic = \"Persistence, Privilege Escalation\"\n    mitre_technique = \"Account Manipulation: Additional Cloud Roles\"\n\n\n  events:\n    $e.metadata.event_type = \"USER_RESOURCE_UPDATE_PERMISSIONS\"\n    $e.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $e.metadata.product_event_type = \"SetIamPolicy\" \n    $e.metadata.product_name = \"Google Cloud Platform\"\n    $e.principal.user.attribute.roles.description = \"ADD\"\n\n    (\n    $e.target.resource.attribute.labels[\"ser_binding_deltas_role\"] = \"roles/owner\" or \n    $e.target.resource.attribute.labels[\"ser_binding_deltas_role\"] = \"roles/editor\" \n    )\n\n    $e.target.resource.attribute.labels.value = /serviceAccount.*/\n    $e.security_result.action = \"ALLOW\"\n\n    \n\n  outcome:\n    $risk_score = max(70)\n\n\n  condition:\n    $e\n}\n", "liveRuleEnabled": true, "versionCreateTime": "2024-06-26T09:02:39.754703Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-26T09:02:39.754703Z"}