{"ruleId": "ru_2b46d095-67ee-4977-9006-d888e975a2f5", "versionId": "ru_2b46d095-67ee-4977-9006-d888e975a2f5@v_1719744248_763884000", "ruleName": "GCP_high_privilage_account_activity", "metadata": {"severity": "Medium", "author": "Deloitte", "description": "This rule detects a GCP high privilage account activity (user update permission + login)"}, "ruleText": "rule GCP_high_privilage_account_activity \n{\n\n  meta:\n    author = \"Deloitte\"\n    description = \"This rule detects a GCP high privilage account activity (user update permission + login)\"\n    severity = \"Medium\"\n\n  events:\n//Login activity\n    $e.metadata.log_type = \"WORKSPACE_ACTIVITY\"\n    $e.metadata.event_type = \"USER_LOGIN\"\n    $e.metadata.product_event_type = \"login_success\"\n    $e.security_result.action = \"ALLOW\"\n    $e.target.user.email_addresses = $user\n\n//User update permissiom\n    $e1.metadata.event_type = \"USER_RESOURCE_UPDATE_PERMISSIONS\" \n    $e1.principal.user.email_addresses = $user\n\n    $e1.metadata.event_timestamp.seconds <= $e.metadata.event_timestamp.seconds\n\n    match:\n        $user over 2m\n\n    \n  condition:\n    $e and $e1\n}\n", "liveRuleEnabled": true, "versionCreateTime": "2024-06-30T10:44:08.763884Z", "compilationState": "SUCCEEDED", "ruleType": "MULTI_EVENT", "lastAlertStatusChangeTime": "2024-06-26T13:21:39.238911Z"}