{"ruleId": "ru_e28a6c3e-bae1-4b02-8fef-e9cf50ad2f7e", "versionId": "ru_e28a6c3e-bae1-4b02-8fef-e9cf50ad2f7e@v_1718793300_994287000", "ruleName": "gcp_cloud_audit_logging_removed_from_all_services", "metadata": {"severity": "High", "name": "gcp_cloud_audit_logging_removed_from_all_services", "author": "Deloitte", "description": "Detect when GCP Cloud Audit logs are removed from all services at project or organization level. Audit logging helps organizations maintain security and minimize risk.", "mitre_attack_tactic": "Defense Evasion", "mitre_attack_technique": "Impair Defenses: Disable Cloud Logs", "data_source": "GCP Cloud Audit", "platform": "GCP"}, "ruleText": " rule gcp_cloud_audit_logging_removed_from_all_services {\n\n  meta:\n    name=\"gcp_cloud_audit_logging_removed_from_all_services\"\n    author = \"Deloitte\"\n    description = \"Detect when GCP Cloud Audit logs are removed from all services at project or organization level. Audit logging helps organizations maintain security and minimize risk.\"\n    mitre_attack_tactic = \"Defense Evasion\"\n    mitre_attack_technique = \"Impair Defenses: Disable Cloud Logs\"\n    data_source = \"GCP Cloud Audit\"\n    platform = \"GCP\"\n    severity = \"High\"\n\n\n  events:\n    $gcp.metadata.event_type = \"USER_RESOURCE_UPDATE_PERMISSIONS\"\n    $gcp.metadata.log_type = \"GCP_CLOUDAUDIT\"\n    $gcp.metadata.product_event_type = \"SetIamPolicy\"\n    $gcp.security_result.action = \"ALLOW\"\n    $gcp.security_result.detection_fields[\"action\"] = \"REMOVE\"\n    $gcp.security_result.detection_fields[\"SERVICE\"] = \"allServices\"\n    $gcp.target.resource.attribute.labels[\"ser_type\"] = \"type.googleapis.com/google.iam.v1.logging.AuditData\"\n    $gcp.target.application = \"cloudresourcemanager.googleapis.com\"\n\n  outcome:\n    $risk_score = max(45 +\n      if($gcp.target.resource.name = /organizations/,30,0)\n    )\n    $mitre_attack_tactic = \"Defense Evasion\"\n    $mitre_attack_technique = \"Impair Defenses: Disable Cloud Logs\"\n    $mitre_attack_technique_id = \"T1562.008\"\n    $event_count = count_distinct($gcp.metadata.id)\n    $network_http_user_agent = array_distinct($gcp.network.http.user_agent)\n    $principal_ip = array_distinct($gcp.principal.ip)\n    $principal_ip_country = array_distinct($gcp.principal.ip_geo_artifact.location.country_or_region)\n    $principal_ip_state = array_distinct($gcp.principal.ip_geo_artifact.location.state)\n    $principal_user_id = $gcp.principal.user.userid\n    $principal_user_display_name = $gcp.principal.user.user_display_name\n    $target_resource_name = $gcp.target.resource.name\n    $event_name = $gcp.metadata.product_event_type\n\n  condition:\n    $gcp\n}\n", "versionCreateTime": "2024-06-19T10:35:00.994287Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-19T08:50:17.963583Z"}