{"ruleId": "ru_31ca0d7a-80c7-4862-b56d-cf36a272cf52", "versionId": "ru_31ca0d7a-80c7-4862-b56d-cf36a272cf52@v_1722862732_054963000", "ruleName": "GKE_Privileged_container", "metadata": {"author": "Deloitte", "description": "This rule detetcs When a there is a misconfiguration: container is given privileged mode. When a contatiner is given this mode it receives all permissions the host has", "severity": "Medium", "mitre": "T1068", "name": "GKE_Misconfiguration"}, "ruleText": "rule GKE_Privileged_container\n{\n\n  meta:\n    name = \"GKE_Misconfiguration\"\n    author = \"Deloitte\"\n    description = \"This rule detetcs When a there is a misconfiguration: container is given privileged mode. When a contatiner is given this mode it receives all permissions the host has\" \n    severity = \"Medium\"\n    mitre = \"T1068\"\n\n  events:\n\n    $e.metadata.description = \"GKE Security Posture\"\n    $e.metadata.log_type = \"GCP_SECURITYCENTER_MISCONFIGURATION\"\n    $e.metadata.product_event_type = \"GKE_PRIVILEGED_CONTAINERS\"\n    $e.metadata.product_name = \"Security Command Center\"\n    $e.security_result.detection_fields[\"state\"] = \"ACTIVE\"\n\n\n  condition:\n    $e\n}\n", "liveRuleEnabled": true, "versionCreateTime": "2024-08-05T12:58:52.054963Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-30T11:42:50.149711Z"}