{"ruleId": "ru_5e64c50c-17f1-4235-bf8a-c91caab3abdb", "versionId": "ru_5e64c50c-17f1-4235-bf8a-c91caab3abdb@v_1719320966_592847000", "ruleName": "Google_W_Admin_Login_Out_Work_Hours_or_not_in_Admin_List", "metadata": {"mitre_tactic": "{NA: Not Applicable}", "name": "Google_W_Admin_Login_Out_Work_Hours_or_not_in_Admin_List", "author": "Deloitte", "description": "This rule detect an administrator login after login hours/ logins in the weekened (06= Friday , 07= Saturday)/ login NOT from the Administrator list", "severity": "High", "mitre_technique": "{NA: Not Applicable}"}, "ruleText": "rule Google_W_Admin_Login_Out_Work_Hours_or_not_in_Admin_List\n{\n  meta:\n    name = \"Google_W_Admin_Login_Out_Work_Hours_or_not_in_Admin_List\"\n    author = \"Deloitte\"\n    description = \"This rule detect an administrator login after login hours/ logins in the weekened (06= Friday , 07= Saturday)/ login NOT from the Administrator list\"\n    severity = \"High\"\n    mitre_technique = \"{NA: Not Applicable}\"\n    mitre_tactic = \"{NA: Not Applicable}\"\n\n\n  events:\n    $workspace.metadata.vendor_name = \"Google Workspace\"\n    $workspace.metadata.event_type = \"USER_LOGIN\"\n    $workspace.target.user.attribute.roles.type = \"ADMINISTRATOR\"\n    $workspace.security_result.action = \"ALLOW\"\n    $workspace.target.user.email_addresses = $superUser\n    $ts3 = $workspace.metadata.event_timestamp.seconds\n    06 = timestamp.get_day_of_week($ts3, \"+3\") or 07 = timestamp.get_day_of_week($ts3, \"+3\") or (timestamp.get_hour($ts3 ,\"+3\") >19) or (timestamp.get_hour($ts3 ,\"+3\") <7) \n   // or (not strings.concat($workspace.target.user.email_addresses[0], \"\") in %Google_Workspace_Administrators) - need to create admin list\n\n\n \n  condition:\n    $workspace\n\n}\n", "alertingEnabled": true, "liveRuleEnabled": true, "versionCreateTime": "2024-06-25T13:09:26.592847Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-07-28T18:39:42.427690Z"}