{"ruleId": "ru_7d976bdf-7749-43b7-8646-7e7760697468", "versionId": "ru_7d976bdf-7749-43b7-8646-7e7760697468@v_1722254009_284321000", "ruleName": "Google_W_Multiple_Logins_Failure", "metadata": {"severity": "Medium", "name": "Google_W_Multiple_Logins_Failure", "author": "Deloitte", "description": "This rule idetifies multiple logins faliure in 5 minutes"}, "ruleText": "rule Google_W_Multiple_Logins_Failure \n{\n\n  meta:\n    name = \"Google_W_Multiple_Logins_Failure\"\n    author = \"Deloitte\"\n    description = \"This rule idetifies multiple logins faliure in 5 minutes\"\n    severity = \"Medium\"\n    \n\n  events:\n    $e.metadata.event_type = \"USER_LOGIN\"\n    $e.metadata.log_type = \"WORKSPACE_ACTIVITY\"\n    $e.metadata.product_event_type = \"login_failure\"\n    $e.security_result.action = \"BLOCK\"\n    $e.target.application = \"Login\"\n    $e.target.user.email_addresses = $user_tried_to_login\n\n  match:\n    $user_tried_to_login over 1m\n  \n  condition:\n    #e >= 5\n\n}\n", "versionCreateTime": "2024-07-29T11:53:29.284321Z", "compilationState": "SUCCEEDED", "ruleType": "MULTI_EVENT", "lastAlertStatusChangeTime": "2024-06-26T14:57:23.788047Z"}