{"ruleId": "ru_713c1926-4f56-45db-9fba-28f6592ed861", "versionId": "ru_713c1926-4f56-45db-9fba-28f6592ed861@v_1716973402_589983000", "ruleName": "Google_W_0013_links_files_outside_domain", "metadata": {"name": "Google_W_0013_links_files_outside_domain", "author": "Deloitte", "description": "This rule detects emails sends outside the domain and contains files or links", "severity": "Medium"}, "ruleText": "rule Google_W_0013_links_files_outside_domain \n{\n\n  meta:\n    name = \"Google_W_0013_links_files_outside_domain\"\n    author = \"Deloitte\"\n    description = \"This rule detects emails sends outside the domain and contains files or links\"\n    severity = \"Medium\"\n    // mitre_attack_tactic = \"\"\n    // mitre_attack_technique = \"\"\n\n  events:\n    $e.metadata.event_type = \"EMAIL_TRANSACTION\"\n    $e.metadata.log_type = \"WORKSPACE_ACTIVITY\" \n    $e.metadata.vendor_name = \"Google Workspace\"\n    $e.principal.administrative_domain != /@iaec.gov\\.il$/ or $e.about.domain.name != /@iaec.gov\\.il$/ \n    $e.network.smtp.rcpt_to = /@iaec.gov\\.il$/\n    $e.principal.user.email_addresses != /@iaec.gov\\.il$/\n    $e.principal.application = \"smtp-inbound\"\n    $e.about.file.file_type = \"FILE_TYPE_PDF\" //PDF \n    or $e.about.file.file_type = \"FILE_TYPE_XLSX\" //EXCEL\n    or $e.about.file.file_type =\"FILE_TYPE_JPEG\" \n    or $e.about.file.file_type =\"FILE_TYPE_DOCX\" //DOCS\n    or $e.about.file.file_type =\"FILE_TYPE_DOC\" //DOC\n    or $e.about.file.file_type = \"FILE_TYPE_PNG\" \n    or $e.about.file.file_type = \"FILE_TYPE_EMAIL_TYPE\" \n    or $e.about.file.file_type = \"FILE_TYPE_PE_EXE\" //exe\n    or $e.about.file.file_type =\"FILE_TYPE_HTML\" //HTML\n    or $e.about.file.file_type = \"FILE_TYPE_JAVASCRIPT\" //Javascript\n    or $e.about.file.file_type = \"FILE_TYPE_VBA\"\n    or $e.about.file.file_type = \"FILE_TYPE_LNK\" //links \n    or $e.about.file.file_type = \"FILE_TYPE_JAR\" //Java \n    or $e.about.file.file_type = \"FILE_TYPE_ISOIMAGE\" //Disk\n    or $e.about.file.file_type = \"FILE_TYPE_PPT\" //Powerpoint\n    or $e.about.file.file_type = \"FILE_TYPE_DMG\" //mac\n    or $e.about.file.file_type = \"FILE_TYPE_RTF\" \n    or $e.about.file.file_type = \"FILE_TYPE_ANDROID\" //apk \n    or $e.about.file.file_type = \"FILE_TYPE_POWERSHELL\" //PS\n    or $e.about.file.file_type = \"FILE_TYPE_ZIP\" //ZIP\n\n\n    //$e.security_result.category = \"MAIL_SPAM\"\n    // not (net.ip_in_range_cidr($e.intermediary.ip,\"10.0.0.0/8\") \n    // or net.ip_in_range_cidr($e.intermediary.ip,\"172.16.0.0/12\") \n    // or net.ip_in_range_cidr($e.intermediary.ip,\"192.168.0.0/16\")) \n\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-05-29T09:03:22.589983Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-05-28T09:23:32.335375Z"}