{"ruleId": "ru_05b0174a-c3f9-4159-a19f-8e0d0938b22e", "versionId": "ru_05b0174a-c3f9-4159-a19f-8e0d0938b22e@v_1719321193_661503000", "ruleName": "Google_W_user_creation", "metadata": {"author": "Deloitte", "description": "This rule idetifies when a new user created in Google Workspace", "severity": "Medium"}, "ruleText": "rule Google_W_user_creation \n{\n  meta:\n    author = \"Deloitte\"\n    description = \"This rule idetifies when a new user created in Google Workspace\"\n    severity = \"Medium\"\n\n  events:\n\n    $e.metadata.event_type = \"USER_CREATION\"\n    $e.metadata.product_event_type = \"CREATE_USER\"\n    $e.metadata.log_type = \"WORKSPACE_ACTIVITY\"\n    $e.metadata.vendor_name = \"Google Workspace\"\n    $e.metadata.product_name = \"admin\"\n    $e.principal.ip_geo_artifact.location.country_or_region = $source_country\n    $e.principal.user.attribute.labels[\"actor_caller_type\"] = \"USER\"\n    $e.target.application = \"Admin\"\n    $e.target.resource.resource_type = \"SETTING\"\n\n \n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-06-25T13:13:13.661503Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-25T13:13:13.661503Z"}