{"ruleId": "ru_6fc7ab31-f61c-4faa-a941-ddd09f2ecfa6", "versionId": "ru_6fc7ab31-f61c-4faa-a941-ddd09f2ecfa6@v_1719321050_209993000", "ruleName": "Google_W_new_trusted_domain_added", "metadata": {"severity": "High", "description": "This rule is identifying when a domain is added to the list of trusted domains in Google Workspace or removed. An adversary may attempt to manipulate sharing settings for trusted domains to gain unauthorized access to sensitive files and folders within an organization.", "mitre_technique": "{Defense Evasion}", "mitre_tactic": "{'T1562.007' : 'Impair Defenses': 'Disable or Modify Cloud Firewall'}", "name": "Google_W_new_trusted_domain_added", "author": "Deloitte"}, "ruleText": "rule Google_W_new_trusted_domain_added \n{\n   meta:\n      name = \"Google_W_new_trusted_domain_added\"\n      author = \"Deloitte\"\n      severity = \"High\"\n      description = \"This rule is identifying when a domain is added to the list of trusted domains in Google Workspace or removed. An adversary may attempt to manipulate sharing settings for trusted domains to gain unauthorized access to sensitive files and folders within an organization.\"\n      mitre_technique = \"{Defense Evasion}\"\n      mitre_tactic = \"{'T1562.007' : 'Impair Defenses': 'Disable or Modify Cloud Firewall'}\"\n\n    events:\n      $e.metadata.vendor_name = \"Google Workspace\"\n      $e.metadata.product_name = \"admin\"\n      $e.metadata.product_event_type = \"ADD_TRUSTED_DOMAINS\" //parsing needed for remove-> or $e.metadata.product_event_type = \"REMOVE_TRUSTED_DOMAINS\"\n      $e.metadata.event_type = \"USER_RESOURCE_UPDATE_CONTENT\"\n      $e.metadata.log_type = \"WORKSPACE_ACTIVITY\"\n      $e.security_result.category_details = \"DOMAIN_SETTINGS\"\n      $e.target.application = \"Admin\"\n      $e.target.resource.resource_type = \"SETTING\"\n\n\n    condition:\n      $e\n  }\n", "liveRuleEnabled": true, "versionCreateTime": "2024-06-25T13:10:50.209993Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-05T08:35:34.114191Z"}