{"ruleId": "ru_66643935-705f-40b3-844f-e4f7a80f341e", "versionId": "ru_66643935-705f-40b3-844f-e4f7a80f341e@v_1717327975_915695000", "ruleName": "Login_aws_outside_country", "metadata": {"severity": "Medium", "author": "Deloitte", "description": "This rule detects user login to AWS environment outside the country (=Israel)"}, "ruleText": "rule Login_aws_outside_country\n{\n  meta:\n    author = \"Deloitte\"\n    description = \"This rule detects user login to AWS environment outside the country (=Israel)\"\n    severity = \"Medium\"\n\n  events:\n    $e.metadata.product_name = \"AWS CloudTrail\"\n    $e.metadata.event_type = \"USER_LOGIN\"\n    (\n    $e.principal.location.country_or_region != \"Israel\"\n    or\n    $e.principal.ip_geo_artifact.location.country_or_region != \"Israel\"\n    )\n    //Option to attach list of known vpn ip address range to extend the rule\n    // or\n    // not $e.principal.ip in %list of known IP address range \n    // )\n\n  outcome:\n    $risk_score = 95\n\n  condition:\n    $e\n}\n", "versionCreateTime": "2024-06-02T11:32:55.915695Z", "compilationState": "SUCCEEDED", "ruleType": "SINGLE_EVENT", "lastAlertStatusChangeTime": "2024-06-02T07:53:29.014447Z"}