{"ruleId": "ru_2bd89b12-d2ad-40bb-adb5-d4c006fc63c6", "versionId": "ru_2bd89b12-d2ad-40bb-adb5-d4c006fc63c6@v_1723029552_309135000", "ruleName": "Network_Whois_Expired_Domain_Accessed", "metadata": {"name": "Network_Whois_Expired_Domain_Accessed", "author": "Deloitte", "description": "Example usage of WHOIS data, detecting an executable file download from a domain that's recently expired", "tags": "whois", "severity": "Low"}, "ruleText": "rule Network_Whois_Expired_Domain_Accessed {\n\n  meta:\n    name=\"Network_Whois_Expired_Domain_Accessed\"\n    author = \"Deloitte\"\n    description = \"Example usage of WHOIS data, detecting an executable file download from a domain that's recently expired\"\n    tags = \"whois\"\n    severity = \"Low\"\n\n\n  events:\n    $access.metadata.event_type = \"NETWORK_HTTP\"\n    $access.target.hostname = $hostname\n\n    // join access event to entity graph to use WHOIS data\n    $whois.graph.entity.domain.name = $hostname\n\n    // Whois domains provided by GCTI Feed\n    $whois.graph.metadata.entity_type = \"DOMAIN_NAME\"\n    $whois.graph.metadata.vendor_name = \"WHOIS\"\n    $whois.graph.metadata.product_name = \"WHOISXMLAPI Simple Whois\"\n    $whois.graph.metadata.source_type = \"GLOBAL_CONTEXT\"\n    // Domain expired before the event\n    $whois.graph.entity.domain.expiration_time.seconds < $access.metadata.event_timestamp.seconds\n\n  match:\n    $hostname over 1h\n\n  outcome:\n    $risk_score = max(20)\n    $event_count = count_distinct($access.metadata.id)\n    //added to populate alert graph with additional context\n    $principal_hostname = array_distinct($access.principal.hostname)\n    // Commented out principal.hostname because it is already represented in graph as match variable. If match changes, can uncomment to add to results\n    //$target_hostname = array_distinct($access.target.hostname)\n    $principal_process_pid = array_distinct($access.principal.process.pid)\n    $principal_process_command_line = array_distinct($access.principal.process.command_line)\n    $principal_process_file_sha256 = array_distinct($access.principal.process.file.sha256)\n    $principal_process_file_full_path = array_distinct($access.principal.process.file.full_path)\n    $principal_process_product_specific_process_id = array_distinct($access.principal.process.product_specific_process_id)\n    $principal_process_parent_process_product_specific_process_id = array_distinct($access.principal.process.parent_process.product_specific_process_id)\n    $target_process_pid = array_distinct($access.target.process.pid)\n    $target_process_command_line = array_distinct($access.target.process.command_line)\n    $target_process_file_sha256 = array_distinct($access.target.process.file.sha256)\n    $target_process_file_full_path = array_distinct($access.target.process.file.full_path)\n    $target_process_product_specific_process_id = array_distinct($access.target.process.product_specific_process_id)\n    $target_process_parent_process_product_specific_process_id = array_distinct($access.target.process.parent_process.product_specific_process_id)\n    $principal_user_userid = array_distinct($access.principal.user.userid)\n    $target_user_userid = array_distinct($access.target.user.userid)\n    $target_url = array_distinct($access.target.url)\n\n condition:\n    $access and $whois\n}\n", "versionCreateTime": "2024-08-07T11:19:12.309135Z", "compilationState": "SUCCEEDED", "ruleType": "MULTI_EVENT", "lastAlertStatusChangeTime": "2024-08-07T11:19:12.309135Z"}