{"ruleId": "ru_33363c16-ad11-4651-884b-558c480a2361", "versionId": "ru_33363c16-ad11-4651-884b-558c480a2361@v_1723018552_823103000", "ruleName": "Network_GCTI_TOR_Exit_Nodes", "metadata": {"mitre_attack_tactic": "Command and Control", "mitre_attack_technique": "{'T1090.003' : 'Proxy: Multi-hop Proxy'}", "tags": "tor", "severity": "High", "name": "Network_GCTI_TOR_Exit_Nodes", "author": "Deloitte", "description": "Alert traffic destined for known Tor exit nodes"}, "ruleText": "rule Network_GCTI_TOR_Exit_Nodes {\n\n  meta:\n    name=\"Network_GCTI_TOR_Exit_Nodes\"\n    author = \"Deloitte\"\n    description = \"Alert traffic destined for known Tor exit nodes\"\n    mitre_attack_tactic = \"Command and Control\"\n    mitre_attack_technique = \"{'T1090.003' : 'Proxy: Multi-hop Proxy'}\"\n    tags = \"tor\"\n    severity = \"High\"\n\n  events:\n    $network.metadata.event_type = \"NETWORK_CONNECTION\"\n    $network.target.ip = $ip\n\n    // Tor IP listing provided by GCTI Feed\n    $gcti_feed.graph.entity.artifact.ip = $ip\n    $gcti_feed.graph.metadata.entity_type = \"IP_ADDRESS\"\n    $gcti_feed.graph.metadata.threat.threat_feed_name = \"Tor Exit Nodes\"\n    $gcti_feed.graph.metadata.product_name = \"GCTI Feed\"\n    $gcti_feed.graph.metadata.source_type = \"GLOBAL_CONTEXT\"\n\n  match:\n    $ip over 1h\n\n  outcome:\n    $risk_score = max(85)\n    $mitre_attack_tactic = array_distinct(\"Command and Control\")\n    $mitre_attack_technique = array_distinct(\"Proxy: Multi-hop Proxy\")\n    $mitre_attack_technique_id = array_distinct(\"T1090.003\")\n    $event_count = count_distinct($network.metadata.id)\n    $tor_geoip_country = array_distinct($network.target.ip_geo_artifact.location.country_or_region)\n    $tor_geoip_state = array_distinct($network.target.ip_geo_artifact.location.state)\n    // added to populate alert graph with additional context\n    $principal_ip = array_distinct($network.principal.ip)\n    // Commented out target.ip because it is already represented in graph as match variable. If match changes, can uncomment to add to results\n    //$target_ip = array_distinct($network.target.ip)\n    $principal_process_pid = array_distinct($network.principal.process.pid)\n    $principal_process_command_line = array_distinct($network.principal.process.command_line)\n    $principal_process_file_sha256 = array_distinct($network.principal.process.file.sha256)\n    $principal_process_file_full_path = array_distinct($network.principal.process.file.full_path)\n    $principal_process_product_specific_process_id = array_distinct($network.principal.process.product_specific_process_id)\n    $principal_process_parent_process_product_specific_process_id = array_distinct($network.principal.process.parent_process.product_specific_process_id)\n    $target_process_pid = array_distinct($network.target.process.pid)\n    $target_process_command_line = array_distinct($network.target.process.command_line)\n    $target_process_file_sha256 = array_distinct($network.target.process.file.sha256)\n    $target_process_file_full_path = array_distinct($network.target.process.file.full_path)\n    //$target_process_product_specific_process_id = array_distinct($network.target.process.product_specific_process_id)\n    //$target_process_parent_process_product_specific_process_id = array_distinct($network.target.process.parent_process.product_specific_process_id)\n    $principal_user_userid = array_distinct($network.principal.user.userid)\n    $target_user_userid = array_distinct($network.target.user.userid)\n\n  condition:\n    $network and $gcti_feed\n}\n", "versionCreateTime": "2024-08-07T08:15:52.823103Z", "compilationState": "SUCCEEDED", "ruleType": "MULTI_EVENT", "lastAlertStatusChangeTime": "2024-08-07T08:10:20.008175Z"}