{"ruleId": "ru_537cb597-4be0-4658-bef9-c37bbb0677da", "versionId": "ru_537cb597-4be0-4658-bef9-c37bbb0677da@v_1723029697_179986000", "ruleName": "Network_Whois_Recently_Created_Domain_Access", "metadata": {"name": "Network_Whois_Recently_Created_Domain_Access", "author": "Deloitte", "description": "Detects access attempts to a newly created domain via WHOIS enrichment.", "rule_name": "WHOIS Recently Created Domain Access", "severity": "Info"}, "ruleText": "rule Network_Whois_Recently_Created_Domain_Access {\n\n  meta:\n    name=\"Network_Whois_Recently_Created_Domain_Access\"\n    author = \"Deloitte\"\n    description = \"Detects access attempts to a newly created domain via WHOIS enrichment.\"\n    rule_name = \"WHOIS Recently Created Domain Access\"\n    severity = \"Info\"\n\n  events:\n    ($access.metadata.event_type = \"NETWORK_HTTP\" or $access.metadata.event_type = \"NETWORK_CONNECTION\")\n\n    // join access event to entity graph to use WHOIS data\n    $access.target.hostname = $domain\n\n    // Whois domains provided by GCTI Feed\n    $whois.graph.entity.domain.name = $domain\n    $whois.graph.metadata.entity_type = \"DOMAIN_NAME\"\n    $whois.graph.metadata.vendor_name = \"WHOIS\"\n    $whois.graph.metadata.product_name = \"WHOISXMLAPI Simple Whois\"\n    $whois.graph.metadata.source_type = \"GLOBAL_CONTEXT\"\n    $whois.graph.entity.domain.creation_time.seconds > 0\n\n    // domain was created in the last 30 days\n    2592000 > timestamp.current_seconds() - $whois.graph.entity.domain.creation_time.seconds\n\n  match:\n    $domain over 1h\n\n  outcome:\n    $risk_score = max(20)\n    $event_count = count_distinct($access.metadata.id)\n    //added to populate alert graph with additional context\n    $principal_hostname = array_distinct($access.principal.hostname)\n    // Commented out target.hostname because it is already represented in graph as match variable. If match changes, can uncomment to add to results\n    //$target_hostname = array_distinct($access.target.hostname)\n    $principal_process_pid = array_distinct($access.principal.process.pid)\n    $principal_process_command_line = array_distinct($access.principal.process.command_line)\n    $principal_process_file_sha256 = array_distinct($access.principal.process.file.sha256)\n    $principal_process_file_full_path = array_distinct($access.principal.process.file.full_path)\n    $principal_process_product_specific_process_id = array_distinct($access.principal.process.product_specific_process_id)\n    $principal_process_parent_process_product_specific_process_id = array_distinct($access.principal.process.parent_process.product_specific_process_id)\n    $target_process_pid = array_distinct($access.target.process.pid)\n    $target_process_command_line = array_distinct($access.target.process.command_line)\n    $target_process_file_sha256 = array_distinct($access.target.process.file.sha256)\n    $target_process_file_full_path = array_distinct($access.target.process.file.full_path)\n    $target_process_product_specific_process_id = array_distinct($access.target.process.product_specific_process_id)\n    $target_process_parent_process_product_specific_process_id = array_distinct($access.target.process.parent_process.product_specific_process_id)\n    $principal_user_userid = array_distinct($access.principal.user.userid)\n    $target_user_userid = array_distinct($access.target.user.userid)\n    $target_url = array_distinct($access.target.url)\n\n  condition:\n    $access and $whois\n}\n", "versionCreateTime": "2024-08-07T11:21:37.179986Z", "compilationState": "SUCCEEDED", "ruleType": "MULTI_EVENT", "lastAlertStatusChangeTime": "2024-08-07T11:21:06.632031Z"}